AlmAck/svdtonuttx/demo/h/da1470x_crg_xtal.h
/****************************************************************************
 * ./tmp/da1470x_crg_xtal.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __DA1470X_CRG_XTAL_H
#define __DA1470X_CRG_XTAL_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "da1470x_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define DA1470X_CRG_XTAL_PLL_SYS_CTRL1_OFFSET       0x0060 /* System PLL control register 1. */
#define DA1470X_CRG_XTAL_PLL_SYS_CTRL2_OFFSET       0x0064 /* System PLL control register 2. */
#define DA1470X_CRG_XTAL_PLL_SYS_CTRL3_OFFSET       0x0068 /* System PLL control register 3. */
#define DA1470X_CRG_XTAL_PLL_SYS_STATUS_OFFSET      0x0070 /* System PLL status register. */
#define DA1470X_CRG_XTAL_PLL_USB_CTRL1_OFFSET       0x0074 /* USB PLL control register 1. */
#define DA1470X_CRG_XTAL_PLL_USB_CTRL2_OFFSET       0x0078 /* USB PLL control register 2. */
#define DA1470X_CRG_XTAL_PLL_USB_CTRL3_OFFSET       0x007C /* USB PLL control register 3. */
#define DA1470X_CRG_XTAL_PLL_USB_STATUS_OFFSET      0x0080 /* USB PLL status register. */
#define DA1470X_CRG_XTAL_RESET_SYS_IRQ_CTRL_OFFSET  0x0098 /* System IRQ RESET register */
#define DA1470X_CRG_XTAL_SET_SYS_IRQ_CTRL_OFFSET    0x0094 /* System IRQ SET register */
#define DA1470X_CRG_XTAL_SYS_IRQ_CTRL_OFFSET        0x0090 /* System IRQ control register */
#define DA1470X_CRG_XTAL_XTAL32M_CAP_MEAS_OFFSET    0x000C /* Capacitance measure circuit control */
#define DA1470X_CRG_XTAL_XTAL32M_CTRL_OFFSET        0x0014 /* Xtal32m control register */
#define DA1470X_CRG_XTAL_XTAL32M_FSM_OFFSET         0x0010 /* Startup state machine configuration */
#define DA1470X_CRG_XTAL_XTAL32M_IRQ_CTRL_OFFSET    0x0018 /* Xtal32m Interrupt control register */
#define DA1470X_CRG_XTAL_XTAL32M_IRQ_STAT_OFFSET    0x0028 /* XTAL32M IRQ status register */
#define DA1470X_CRG_XTAL_XTAL32M_SETTLE_OFFSET      0x0004 /* Trim values for XTAL32M in SETTLE state of startup */
#define DA1470X_CRG_XTAL_XTAL32M_START_OFFSET       0x0000 /* Trim values for XTAL32M in START state of startup */
#define DA1470X_CRG_XTAL_XTAL32M_STAT0_OFFSET       0x0024 /* XTAL32M status register */
#define DA1470X_CRG_XTAL_XTAL32M_TRIM_OFFSET        0x0008 /* Trim values for XTAL32M in RUNNING state */

/* Register addresses *******************************************************/

#define DA1470X_CRG_XTAL_BASE                       0x50050400 /* CRG_XTAL registers */

#define DA1470X_CRG_XTAL_PLL_SYS_CTRL1              (DA1470X_CRG_XTAL_BASE + DA1470X_CRG_XTAL_PLL_SYS_CTRL1_OFFSET) /* System PLL control register 1. */
#define DA1470X_CRG_XTAL_PLL_SYS_CTRL2              (DA1470X_CRG_XTAL_BASE + DA1470X_CRG_XTAL_PLL_SYS_CTRL2_OFFSET) /* System PLL control register 2. */
#define DA1470X_CRG_XTAL_PLL_SYS_CTRL3              (DA1470X_CRG_XTAL_BASE + DA1470X_CRG_XTAL_PLL_SYS_CTRL3_OFFSET) /* System PLL control register 3. */
#define DA1470X_CRG_XTAL_PLL_SYS_STATUS             (DA1470X_CRG_XTAL_BASE + DA1470X_CRG_XTAL_PLL_SYS_STATUS_OFFSET) /* System PLL status register. */
#define DA1470X_CRG_XTAL_PLL_USB_CTRL1              (DA1470X_CRG_XTAL_BASE + DA1470X_CRG_XTAL_PLL_USB_CTRL1_OFFSET) /* USB PLL control register 1. */
#define DA1470X_CRG_XTAL_PLL_USB_CTRL2              (DA1470X_CRG_XTAL_BASE + DA1470X_CRG_XTAL_PLL_USB_CTRL2_OFFSET) /* USB PLL control register 2. */
#define DA1470X_CRG_XTAL_PLL_USB_CTRL3              (DA1470X_CRG_XTAL_BASE + DA1470X_CRG_XTAL_PLL_USB_CTRL3_OFFSET) /* USB PLL control register 3. */
#define DA1470X_CRG_XTAL_PLL_USB_STATUS             (DA1470X_CRG_XTAL_BASE + DA1470X_CRG_XTAL_PLL_USB_STATUS_OFFSET) /* USB PLL status register. */
#define DA1470X_CRG_XTAL_RESET_SYS_IRQ_CTRL         (DA1470X_CRG_XTAL_BASE + DA1470X_CRG_XTAL_RESET_SYS_IRQ_CTRL_OFFSET) /* System IRQ RESET register */
#define DA1470X_CRG_XTAL_SET_SYS_IRQ_CTRL           (DA1470X_CRG_XTAL_BASE + DA1470X_CRG_XTAL_SET_SYS_IRQ_CTRL_OFFSET) /* System IRQ SET register */
#define DA1470X_CRG_XTAL_SYS_IRQ_CTRL               (DA1470X_CRG_XTAL_BASE + DA1470X_CRG_XTAL_SYS_IRQ_CTRL_OFFSET) /* System IRQ control register */
#define DA1470X_CRG_XTAL_XTAL32M_CAP_MEAS           (DA1470X_CRG_XTAL_BASE + DA1470X_CRG_XTAL_XTAL32M_CAP_MEAS_OFFSET) /* Capacitance measure circuit control */
#define DA1470X_CRG_XTAL_XTAL32M_CTRL               (DA1470X_CRG_XTAL_BASE + DA1470X_CRG_XTAL_XTAL32M_CTRL_OFFSET) /* Xtal32m control register */
#define DA1470X_CRG_XTAL_XTAL32M_FSM                (DA1470X_CRG_XTAL_BASE + DA1470X_CRG_XTAL_XTAL32M_FSM_OFFSET) /* Startup state machine configuration */
#define DA1470X_CRG_XTAL_XTAL32M_IRQ_CTRL           (DA1470X_CRG_XTAL_BASE + DA1470X_CRG_XTAL_XTAL32M_IRQ_CTRL_OFFSET) /* Xtal32m Interrupt control register */
#define DA1470X_CRG_XTAL_XTAL32M_IRQ_STAT           (DA1470X_CRG_XTAL_BASE + DA1470X_CRG_XTAL_XTAL32M_IRQ_STAT_OFFSET) /* XTAL32M IRQ status register */
#define DA1470X_CRG_XTAL_XTAL32M_SETTLE             (DA1470X_CRG_XTAL_BASE + DA1470X_CRG_XTAL_XTAL32M_SETTLE_OFFSET) /* Trim values for XTAL32M in SETTLE state of startup */
#define DA1470X_CRG_XTAL_XTAL32M_START              (DA1470X_CRG_XTAL_BASE + DA1470X_CRG_XTAL_XTAL32M_START_OFFSET) /* Trim values for XTAL32M in START state of startup */
#define DA1470X_CRG_XTAL_XTAL32M_STAT0              (DA1470X_CRG_XTAL_BASE + DA1470X_CRG_XTAL_XTAL32M_STAT0_OFFSET) /* XTAL32M status register */
#define DA1470X_CRG_XTAL_XTAL32M_TRIM               (DA1470X_CRG_XTAL_BASE + DA1470X_CRG_XTAL_XTAL32M_TRIM_OFFSET) /* Trim values for XTAL32M in RUNNING state */

/* Register bit definitions *************************************************/


/* PLL_SYS_CTRL1 Register */

