AlmAck/svdtonuttx/demo/h/da1470x_crg_xtal.h
#define CRG_XTAL_PLL_OUT_DIV                        (1U << 15) /* 0: Output divider ON 1: Output divider OFF */
#define CRG_XTAL_PLL_SEL_MIN_CUR_INT                (1U << 14) /* 0: VCO current read from min_current <5:0>, 1: VCO current is internally determi */
#define CRG_XTAL_PLL_PRE_DIV                        (1U << 11) /* PLL input divider (1: Indicates divide by 2). */
#define CRG_XTAL_PLL_N_DIV_MASK                     (0x7F << 4) /* PLL loop divider N (x means divide by x, 0 means divide by 1) */
#define CRG_XTAL_PLL_N_DIV_POS                      (4) /* PLL loop divider N (x means divide by x, 0 means divide by 1) */
#define CRG_XTAL_LDO_PLL_VREF_HOLD                  (1U << 3) /* 0: Indicates that the reference input is tracked, 1: Indicates that the referenc */
#define CRG_XTAL_LDO_PLL_ENABLE                     (1U << 2) /* 0: LDO PLL off, 1: LDO PLL on. */
#define CRG_XTAL_PLL_RST_N                          (1U << 1) /* 0: PLL in Reset 1L PLL out of Reset */
#define CRG_XTAL_PLL_EN                             (1U << 0) /* 0: Power down 1: PLL on */

/* PLL_SYS_CTRL2 Register */

#define CRG_XTAL_PLL_RECALIB                        (1U << 15) /* Recalibrate */

/* PLL_SYS_CTRL3 Register */

#define CRG_XTAL_PLL_MIN_CURRENT_MASK               (0x3F << 1) /* VCO current trimming. */
#define CRG_XTAL_PLL_MIN_CURRENT_POS                (1) /* VCO current trimming. */

/* PLL_SYS_STATUS Register */

#define CRG_XTAL_LDO_PLL_OK                         (1U << 15) /* 1: Indicates that LDO PLL is in regulation. */
#define CRG_XTAL_PLL_CALIBRATION_END                (1U << 11) /* Indicates that calibration has finished. */
#define CRG_XTAL_PLL_BEST_MIN_CUR_MASK              (0x3F << 5) /* Calibrated VCO current. */
#define CRG_XTAL_PLL_BEST_MIN_CUR_POS               (5) /* Calibrated VCO current. */
#define CRG_XTAL_PLL_LOCK_FINE                      (1U << 0) /* 1: PLL locked */

/* PLL_USB_CTRL1 Register */

#define CRG_XTAL_PLL_OUT_DIV                        (1U << 15) /* 0: Output divider ON 1: Output divider OFF */
#define CRG_XTAL_PLL_SEL_MIN_CUR_INT                (1U << 14) /* 0: VCO current read from min_current <5:0>, 1: VCO current is internally determi */
#define CRG_XTAL_PLL_PRE_DIV                        (1U << 11) /* PLL input divider (1: Indicates divide by 2). */
#define CRG_XTAL_PLL_N_DIV_MASK                     (0x7F << 4) /* PLL loop divider N (x means divide by x, 0 means divide by 1) */
#define CRG_XTAL_PLL_N_DIV_POS                      (4) /* PLL loop divider N (x means divide by x, 0 means divide by 1) */
#define CRG_XTAL_LDO_PLL_VREF_HOLD                  (1U << 3) /* 0: Indicates that the reference input is tracked, 1: Indicates that the referenc */
#define CRG_XTAL_LDO_PLL_ENABLE                     (1U << 2) /* 0: LDO PLL off, 1: LDO PLL on. */
#define CRG_XTAL_PLL_RST_N                          (1U << 1) /* 0: PLL in Reset 1L PLL out of Reset */
#define CRG_XTAL_PLL_EN                             (1U << 0) /* 0: Power down 1: PLL on */

/* PLL_USB_CTRL2 Register */

#define CRG_XTAL_PLL_RECALIB                        (1U << 15) /* Recalibrate */

/* PLL_USB_CTRL3 Register */

#define CRG_XTAL_PLL_MIN_CURRENT_MASK               (0x3F << 1) /* VCO current trimming. */
#define CRG_XTAL_PLL_MIN_CURRENT_POS                (1) /* VCO current trimming. */

/* PLL_USB_STATUS Register */

#define CRG_XTAL_LDO_PLL_OK                         (1U << 15) /* 1: Indicates that LDO PLL is in regulation. */
#define CRG_XTAL_PLL_CALIBRATION_END                (1U << 11) /* Indicates that calibration has finished. */
#define CRG_XTAL_PLL_BEST_MIN_CUR_MASK              (0x3F << 5) /* Calibrated VCO current. */
#define CRG_XTAL_PLL_BEST_MIN_CUR_POS               (5) /* Calibrated VCO current. */
#define CRG_XTAL_PLL_LOCK_FINE                      (1U << 0) /* 1: PLL locked */

/* RESET_SYS_IRQ_CTRL Register */

#define CRG_XTAL_CMAC2SNC_IRQ_BIT                   (1U << 5) /* When writing a 1, the respective IRQ line will be reset. Writing a 0 is discarde */
#define CRG_XTAL_CMAC2SYS_IRQ_BIT                   (1U << 4) /* When writing a 1, the respective IRQ line will be reset. Writing a 0 is discarde */
#define CRG_XTAL_SNC2SYS_IRQ_BIT                    (1U << 3) /* When writing a 1, the respective IRQ line will be reset. Writing a 0 is discarde */
#define CRG_XTAL_SNC2CMAC_IRQ_BIT                   (1U << 2) /* When writing a 1, the respective IRQ line will be reset. Writing a 0 is discarde */
#define CRG_XTAL_SYS2SNC_IRQ_BIT                    (1U << 1) /* When writing a 1, the respective IRQ line will be reset. Writing a 0 is discarde */
#define CRG_XTAL_SYS2CMAC_IRQ_BIT                   (1U << 0) /* When writing a 1, the respective IRQ line will be reset. Writing a 0 is discarde */

/* SET_SYS_IRQ_CTRL Register */

#define CRG_XTAL_CMAC2SNC_IRQ_BIT                   (1U << 5) /* When writing a 1, the respective IRQ line will be set. Writing a 0 is discarded. */
#define CRG_XTAL_CMAC2SYS_IRQ_BIT                   (1U << 4) /* When writing a 1, the respective IRQ line will be set. Writing a 0 is discarded. */
#define CRG_XTAL_SNC2SYS_IRQ_BIT                    (1U << 3) /* When writing a 1, the respective IRQ line will be set. Writing a 0 is discarded. */
#define CRG_XTAL_SNC2CMAC_IRQ_BIT                   (1U << 2) /* When writing a 1, the respective IRQ line will be set. Writing a 0 is discarded. */
#define CRG_XTAL_SYS2SNC_IRQ_BIT                    (1U << 1) /* When writing a 1, the respective IRQ line will be set. Writing a 0 is discarded. */
#define CRG_XTAL_SYS2CMAC_IRQ_BIT                   (1U << 0) /* When writing a 1, the respective IRQ line will be set. Writing a 0 is discarded. */

/* SYS_IRQ_CTRL Register */

#define CRG_XTAL_CMAC2SNC_IRQ_BIT                   (1U << 5) /* Direct read/write to the specific IRQ bit */
#define CRG_XTAL_CMAC2SYS_IRQ_BIT                   (1U << 4) /* Direct read/write to the specific IRQ bit */
#define CRG_XTAL_SNC2SYS_IRQ_BIT                    (1U << 3) /* Direct read/write to the specific IRQ bit */
#define CRG_XTAL_SNC2CMAC_IRQ_BIT                   (1U << 2) /* Direct read/write to the specific IRQ bit */
#define CRG_XTAL_SYS2SNC_IRQ_BIT                    (1U << 1) /* Direct read/write to the specific IRQ bit */
#define CRG_XTAL_SYS2CMAC_IRQ_BIT                   (1U << 0) /* Direct read/write to the specific IRQ bit */

/* XTAL32M_CAP_MEAS Register */

#define CRG_XTAL_XTAL32M_MEAS_TIME_MASK             (0x7 << 6) /* Select measurement time (in DIVN clock-cycles) 0: 32 1: 64  6: 2048 7: 4096 */
#define CRG_XTAL_XTAL32M_MEAS_TIME_POS              (6) /* Select measurement time (in DIVN clock-cycles) 0: 32 1: 64  6: 2048 7: 4096 */
#define CRG_XTAL_XTAL32M_MEAS_START                 (1U << 5) /* Starts capacitance measurement */
#define CRG_XTAL_XTAL32M_MEAS_CUR_MASK              (0x3 << 3) /* Select measurement current (minimum required capacitance) 0: 100 nA (0.44 pF) 1: */
#define CRG_XTAL_XTAL32M_MEAS_CUR_POS               (3) /* Select measurement current (minimum required capacitance) 0: 100 nA (0.44 pF) 1: */
#define CRG_XTAL_XTAL32M_CAP_SELECT_MASK            (0x7 << 0) /* Select measured capacitance 0: disabled 1: hold capacitance 2: xtal_p 3: xtal_n  */
#define CRG_XTAL_XTAL32M_CAP_SELECT_POS             (0) /* Select measured capacitance 0: disabled 1: hold capacitance 2: xtal_p 3: xtal_n  */

/* XTAL32M_CTRL Register */

#define CRG_XTAL_XTAL32M_DRIVE_CYCLES_MASK          (0x7 << 9) /* Number of drive clock-cycles 0x0: Drive disabled 0x1: 4 0x2: 8 0x3: 16 0x4: 32 0 */
#define CRG_XTAL_XTAL32M_DRIVE_CYCLES_POS           (9) /* Number of drive clock-cycles 0x0: Drive disabled 0x1: 4 0x2: 8 0x3: 16 0x4: 32 0 */
#define CRG_XTAL_XTAL32M_ENABLE                     (1U << 8) /* Enables xtal32m (testing purposes) */
#define CRG_XTAL_XTAL32M_BIASPROT_MASK              (0x3 << 6) /* Bias startup circuit 0: enable during startup 1: always enabled 2: always disabl */
#define CRG_XTAL_XTAL32M_BIASPROT_POS               (6) /* Bias startup circuit 0: enable during startup 1: always enabled 2: always disabl */
#define CRG_XTAL_XTAL32M_LDO_SAH_MASK               (0x3 << 4) /* Controls amplitude regulator sample-and-hold 2'b00: set to HOLD when IRQ fires 2 */
#define CRG_XTAL_XTAL32M_LDO_SAH_POS                (4) /* Controls amplitude regulator sample-and-hold 2'b00: set to HOLD when IRQ fires 2 */
#define CRG_XTAL_XTAL32M_AMPREG_SAH_MASK            (0x3 << 2) /* Controls amplitude regulator sample-and-hold 2'b00: set to HOLD when IRQ fires 2 */
#define CRG_XTAL_XTAL32M_AMPREG_SAH_POS             (2) /* Controls amplitude regulator sample-and-hold 2'b00: set to HOLD when IRQ fires 2 */
#define CRG_XTAL_XTAL32M_BIAS_SAH_MASK              (0x3 << 0) /* Controls bias sample-and-hold 2'b00: set to HOLD when IRQ fires 2'b01: always TR */
#define CRG_XTAL_XTAL32M_BIAS_SAH_POS               (0) /* Controls bias sample-and-hold 2'b00: set to HOLD when IRQ fires 2'b01: always TR */

/* XTAL32M_FSM Register */

#define CRG_XTAL_XTAL32M_BOOST_MODE                 (1U << 5) /* Boost mode configuration 0: Only allow BOOST mode in START state 1: Allow BOOST  */
#define CRG_XTAL_XTAL32M_FSM_APPLY_CONFIG           (1U << 4) /* CUR_SET, AMPL_SET, CMP_LVL and TRIM from XTAL32M_TRIM_REG are 0: applied at next */
#define CRG_XTAL_XTAL32M_FSM_FORCE_IDLE             (1U << 3) /* Forces FSM in IDLE state, allows for software control */
#define CRG_XTAL_XTAL32M_CMP_MODE                   (1U << 2) /* Use the following comparator trim settings in SETTLE state: 0: XTAL32M_TRIM_REG. */
#define CRG_XTAL_XTAL32M_TRIM_MODE                  (1U << 1) /* Use the following trim settings in the SETTLE state: 0: XTAL32M_TRIM_REG.TRIM 1: */
#define CRG_XTAL_XTAL32M_CUR_MODE                   (1U << 0) /* Use the following current setting in the SETTLE state: 0: XTAL32M_START_REG.CUR_ */

/* XTAL32M_IRQ_CTRL Register */

