AlmAck/svdtonuttx/demo/h/da1470x_crg_xtal.h
#define CRG_XTAL_XTAL32M_IRQ_CAP_CTRL_MASK          (0x3 << 10) /* The IRQ counter is captured in the XTAL32M_IRQ_STATUS_REG.IRQ_COUNT_CAP when rea */
#define CRG_XTAL_XTAL32M_IRQ_CAP_CTRL_POS           (10) /* The IRQ counter is captured in the XTAL32M_IRQ_STATUS_REG.IRQ_COUNT_CAP when rea */
#define CRG_XTAL_XTAL32M_IRQ_ENABLE                 (1U << 9) /* Enable xtal interrupt generation. */
#define CRG_XTAL_XTAL32M_IRQ_CLK                    (1U << 8) /* Clock divider for IRQ counter 0: 4 ms 1: 32 ms */
#define CRG_XTAL_XTAL32M_IRQ_CNT_MASK               (0xFF << 0) /* IRQ counter start value. */
#define CRG_XTAL_XTAL32M_IRQ_CNT_POS                (0) /* IRQ counter start value. */

/* XTAL32M_IRQ_STAT Register */

#define CRG_XTAL_XTAL32M_IRQ_COUNT_CAP_MASK         (0xFF << 8) /* Captured IRQ counter */
#define CRG_XTAL_XTAL32M_IRQ_COUNT_CAP_POS          (8) /* Captured IRQ counter */
#define CRG_XTAL_XTAL32M_IRQ_COUNT_STAT_MASK        (0xFF << 0) /* Current IRQ counter value */
#define CRG_XTAL_XTAL32M_IRQ_COUNT_STAT_POS         (0) /* Current IRQ counter value */

/* XTAL32M_SETTLE Register */

#define CRG_XTAL_XTAL32M_TIMEOUT_MASK               (0x7F << 22) /* Timeout 0: disabled 1: 4 ms 2: 8 ms  63: 252 ms 64: 268 ms ... 127: 1260 ms */
#define CRG_XTAL_XTAL32M_TIMEOUT_POS                (22) /* Timeout 0: disabled 1: 4 ms 2: 8 ms  63: 252 ms 64: 268 ms ... 127: 1260 ms */
#define CRG_XTAL_XTAL32M_CMP_BLANK_MASK             (0x7 << 19) /* Blanking time for comparator output 0: disabled 1: 4 ms 2: 8 ms 3: 16 ms 4: 32 m */
#define CRG_XTAL_XTAL32M_CMP_BLANK_POS              (19) /* Blanking time for comparator output 0: disabled 1: 4 ms 2: 8 ms 3: 16 ms 4: 32 m */
#define CRG_XTAL_XTAL32M_CMP_LVL_MASK               (0x3 << 17) /* Comparator triplevel 0: 30 % 1: 35 % 2: 45 % 3: 60 % */
#define CRG_XTAL_XTAL32M_CMP_LVL_POS                (17) /* Comparator triplevel 0: 30 % 1: 35 % 2: 45 % 3: 60 % */
#define CRG_XTAL_XTAL32M_AMPL_SET_MASK              (0x7 << 14) /* Amplitude Regulator input level setting (peak-peak) in SETTLE phase of startup 0 */
#define CRG_XTAL_XTAL32M_AMPL_SET_POS               (14) /* Amplitude Regulator input level setting (peak-peak) in SETTLE phase of startup 0 */
#define CRG_XTAL_XTAL32M_CUR_SET_MASK               (0xF << 10) /* Current setting (units of 16 mA) in SETTLE phase of startup 0: OFF 1: 1x 2: 2x 3 */
#define CRG_XTAL_XTAL32M_CUR_SET_POS                (10) /* Current setting (units of 16 mA) in SETTLE phase of startup 0: OFF 1: 1x 2: 2x 3 */
#define CRG_XTAL_XTAL32M_TRIM_MASK                  (0x3FF << 0) /* Capacitance bank seting in SETLLE phase of startup 0x2BF: lowest oscillation fre */
#define CRG_XTAL_XTAL32M_TRIM_POS                   (0) /* Capacitance bank seting in SETLLE phase of startup 0x2BF: lowest oscillation fre */

/* XTAL32M_START Register */

#define CRG_XTAL_XTAL32M_TIMEOUT_MASK               (0x7F << 22) /* Timeout 0: disabled 1: 4 ms 2: 8 ms  63: 252 ms 64: 268 ms ... 127: 1260 ms */
#define CRG_XTAL_XTAL32M_TIMEOUT_POS                (22) /* Timeout 0: disabled 1: 4 ms 2: 8 ms  63: 252 ms 64: 268 ms ... 127: 1260 ms */
#define CRG_XTAL_XTAL32M_CMP_BLANK_MASK             (0x7 << 19) /* Blanking time for comparator output 0: disabled 1: 4 ms 2: 8 ms 3: 16 ms 4: 32 m */
#define CRG_XTAL_XTAL32M_CMP_BLANK_POS              (19) /* Blanking time for comparator output 0: disabled 1: 4 ms 2: 8 ms 3: 16 ms 4: 32 m */
#define CRG_XTAL_XTAL32M_CMP_LVL_MASK               (0x3 << 17) /* Comparator triplevel 0: 30 % 1: 35 % 2: 45 % 3: 60 % */
#define CRG_XTAL_XTAL32M_CMP_LVL_POS                (17) /* Comparator triplevel 0: 30 % 1: 35 % 2: 45 % 3: 60 % */
#define CRG_XTAL_XTAL32M_AMPL_SET_MASK              (0x7 << 14) /* Amplitude Regulator input level setting (peak-peak) in START phase of startup 0: */
#define CRG_XTAL_XTAL32M_AMPL_SET_POS               (14) /* Amplitude Regulator input level setting (peak-peak) in START phase of startup 0: */
#define CRG_XTAL_XTAL32M_CUR_SET_MASK               (0xF << 10) /* Current setting (units of 16 mA) in START phase of startup 0: OFF 1: 1x 2: 2x 3: */
#define CRG_XTAL_XTAL32M_CUR_SET_POS                (10) /* Current setting (units of 16 mA) in START phase of startup 0: OFF 1: 1x 2: 2x 3: */
#define CRG_XTAL_XTAL32M_TRIM_MASK                  (0x3FF << 0) /* Capacitance bank seting in START phase of startup. 0x2BF: lowest oscillation fre */
#define CRG_XTAL_XTAL32M_TRIM_POS                   (0) /* Capacitance bank seting in START phase of startup. 0x2BF: lowest oscillation fre */

/* XTAL32M_STAT0 Register */

#define CRG_XTAL_XTAL32M_OVERLOAD                   (1U << 29) /* Indicates xtal is overloaded */
#define CRG_XTAL_XTAL32M_CMP_LVL_STAT_MASK          (0x3 << 27) /* Current value for amplitude regulator comparator setting */
#define CRG_XTAL_XTAL32M_CMP_LVL_STAT_POS           (27) /* Current value for amplitude regulator comparator setting */
#define CRG_XTAL_XTAL32M_AMPL_TRIM_MASK             (0x7 << 24) /* Current value for amplitude trim */
#define CRG_XTAL_XTAL32M_AMPL_TRIM_POS              (24) /* Current value for amplitude trim */
#define CRG_XTAL_XTAL32M_TRIM_VAL_MASK              (0x3FF << 14) /* Current value for oscillator trimming */
#define CRG_XTAL_XTAL32M_TRIM_VAL_POS               (14) /* Current value for oscillator trimming */
#define CRG_XTAL_XTAL32M_CUR_SET_STAT_MASK          (0xF << 10) /* Current value for cur_set */
#define CRG_XTAL_XTAL32M_CUR_SET_STAT_POS           (10) /* Current value for cur_set */
#define CRG_XTAL_XTAL32M_LDO_OK                     (1U << 9) /* Indicates LDO voltage level is ok */
#define CRG_XTAL_XTAL32M_CMP_OUT_MASK               (0x3 << 7) /* Amplitude regulator comparator output state */
#define CRG_XTAL_XTAL32M_CMP_OUT_POS                (7) /* Amplitude regulator comparator output state */
#define CRG_XTAL_XTAL32M_STATE_MASK                 (0xF << 3) /* State of xtal startup FSM 0x0: IDLE 0x1: WAIT_LDO 0x2: WAIT_BIAS 0x3: XTAL_DRIVE */
#define CRG_XTAL_XTAL32M_STATE_POS                  (3) /* State of xtal startup FSM 0x0: IDLE 0x1: WAIT_LDO 0x2: WAIT_BIAS 0x3: XTAL_DRIVE */
#define CRG_XTAL_XTAL32M_CMP_OUT_HOLD_MASK          (0x3 << 1) /* Captured state of amplitude regulator comparators at IRQ fire. */
#define CRG_XTAL_XTAL32M_CMP_OUT_HOLD_POS           (1) /* Captured state of amplitude regulator comparators at IRQ fire. */
#define CRG_XTAL_XTAL32M_READY                      (1U << 0) /* Indicates xtal startup FSM has reached the RUNNIG state and is ready for use (sy */

/* XTAL32M_TRIM Register */

#define CRG_XTAL_XTAL32M_BOOST_TRIM_MASK            (0x3F << 19) /* Boost trimming, set accordingly to shunt capacitance. Sensitivity: 125 fF/LSB 0x */
#define CRG_XTAL_XTAL32M_BOOST_TRIM_POS             (19) /* Boost trimming, set accordingly to shunt capacitance. Sensitivity: 125 fF/LSB 0x */
#define CRG_XTAL_XTAL32M_CMP_LVL_MASK               (0x3 << 17) /* Comparator triplevel 0: 30 % 1: 35 % 2: 45 % 3: 60 % */
#define CRG_XTAL_XTAL32M_CMP_LVL_POS                (17) /* Comparator triplevel 0: 30 % 1: 35 % 2: 45 % 3: 60 % */
#define CRG_XTAL_XTAL32M_AMPL_SET_MASK              (0x7 << 14) /* Amplitude Regulator input level setting (peak-peak) in running phase 0: 300 mV 1 */
#define CRG_XTAL_XTAL32M_AMPL_SET_POS               (14) /* Amplitude Regulator input level setting (peak-peak) in running phase 0: 300 mV 1 */
#define CRG_XTAL_XTAL32M_CUR_SET_MASK               (0xF << 10) /* Current setting (units of 16 mA) in running phase 0: OFF 1: 1x 2: 2x 3: 3x 4: 4x */
#define CRG_XTAL_XTAL32M_CUR_SET_POS                (10) /* Current setting (units of 16 mA) in running phase 0: OFF 1: 1x 2: 2x 3: 3x 4: 4x */
#define CRG_XTAL_XTAL32M_TRIM_MASK                  (0x3FF << 0) /* Capacitance bank seting in running phase, use to trim the xtal32m output frequen */
#define CRG_XTAL_XTAL32M_TRIM_POS                   (0) /* Capacitance bank seting in running phase, use to trim the xtal32m output frequen */

#endif /* __DA1470X_CRG_XTAL_H */
